
#ifndef _ADAPTER_H_
#define _ADAPTER_H_


//为了节省IO口，当初设计矩阵键盘的时候，采用的是8*8的布线方式(左右两部分分别是4行8列)
//为了方便调整键序，需要将8*8的矩阵转换为更直观的10*7。
namespace EKEY{
	//L_MatrixAdapter内的值N是按键在L_Martix数组的位置，通过将N的个位、十位拆分，得到
	//L_Martix的行、列index
	uint8_t L_MatrixAdapter[33] = {
		0,//1
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0 //33
	};
	uint8_t R_MatrixAdapter[33] = {
		0,//1
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		0 //33
	};
}
#endif